src/cfe/osn/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/CommonModules/ДоставкаТоваровКлиентСервер/Ext/Module.bsl
&ИзменениеИКонтроль("УстановитьСтраницуДоставки")
Процедура Кт_УстановитьСтраницуДоставки(ЭлементыФормы, СпособДоставки, ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками, ЭтоРаспоряжениеПоСоглашению, ЭтоРаспоряжениеПоДоговору)
	
	СтраницыДоставки = ЭлементыФормы.СтраницыДоставки; // РасширениеГруппыФормыДляСтраниц
	
	Если ЭтоРаспоряжениеПоСоглашению
	 ИЛИ ЭтоРаспоряжениеПоДоговору Тогда
		
		Если ЭлементыФормы.Найти("ГруппаСводнаяИнформацияПоДоставке") <> Неопределено Тогда
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.ГруппаСводнаяИнформацияПоДоставке;
		КонецЕсли;
		Если ЭлементыФормы.Найти("ГруппаСпособДоставкиПеревозчик") <> Неопределено Тогда
			ЭлементыФормы.ГруппаСпособДоставкиПеревозчик.Видимость = Ложь;
		КонецЕсли;
		Если ЭтоРаспоряжениеПоСоглашению
		   И ЭлементыФормы.Найти("ГруппаНадписьНастройкаПараметровДоставки") <> Неопределено Тогда
			ЭлементыФормы.ГруппаНадписьНастройкаПараметровДоставки.ТекущаяСтраница = ЭлементыФормы.ГруппаНадписьНастройкаПараметровДоставкиСоглашение;
		ИначеЕсли Не ЭтоРаспоряжениеПоСоглашению
				И ЭлементыФормы.Найти("ГруппаНадписьНастройкаПараметровДоставки") <> Неопределено Тогда
			ЭлементыФормы.ГруппаНадписьНастройкаПараметровДоставки.ТекущаяСтраница = ЭлементыФормы.ГруппаНадписьНастройкаПараметровДоставкиДоговор;
		КонецЕсли;
		
	Иначе
		
		Если ЭлементыФормы.Найти("ГруппаСпособДоставкиПеревозчик") <> Неопределено Тогда
			ЭлементыФормы.ГруппаСпособДоставкиПеревозчик.Видимость = Истина;
		КонецЕсли;
		
		Если ЭлементыФормы.Найти("СтраницыПеревозчик") <> Неопределено Тогда
			
			СтраницыПеревозчик = ЭлементыФормы.СтраницыПеревозчик; // РасширениеГруппыФормыДляСтраниц
			
			Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика")
			 ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу")
			 ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада")
			 ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи") Тогда
				
				СтраницыПеревозчик.ТекущаяСтраница = ЭлементыФормы.СтраницаПеревозчик;
				
			Иначе
				
				СтраницыПеревозчик.ТекущаяСтраница = ЭлементыФормы.СтраницаПеревозчикПусто;
				
			КонецЕсли;
		КонецЕсли;
		
		Если (СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиентаКурьером"))
		   И (ЭлементыФормы.Найти("СтраницаДоставкаДоПолучателяКурьером") <> Неопределено) Тогда
			
			СтраницыПеревозчик = ЭлементыФормы.СтраницыПеревозчик; // РасширениеГруппыФормыДляСтраниц
			СтраницыПеревозчик.ТекущаяСтраница = ЭлементыФормы.СтраницаКурьер;
			
		КонецЕсли;
		
		Если (СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента")
			  ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки"))
		   И ЭлементыФормы.Найти("СтраницаДоставкаДоПолучателя") <> Неопределено Тогда
			
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаДоПолучателя;
#Вставка
			//***********************************************************************
			//ИЗМЕНЕНО Сухарев Б.В. 14.08.2018
			Если ЭлементыФормы.Найти("ТипДоставки") <> Неопределено Тогда
				ЭлементыФормы.ТипДоставки.Видимость = Истина;
			КонецЕсли;		// ЭлементыФормы.Найти("ТипДоставки") <> Неопределено 		 
			//***********************************************************************			
#КонецВставки
			
		ИначеЕсли (СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиентаКурьером"))
			И (ЭлементыФормы.Найти("СтраницаДоставкаДоПолучателяКурьером") <> Неопределено) Тогда
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаДоПолучателяКурьером;
			
		ИначеЕсли СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика")
				И ЭлементыФормы.Найти("СтраницаДоставкаПеревозчиком") <> Неопределено Тогда
			
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаПеревозчиком;
			
		ИначеЕсли СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") Тогда
			
			Если ЭлементыФормы.Найти("СтраницаДоставкаПеревозчикомПоАдресу") <> Неопределено Тогда
				СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаПеревозчикомПоАдресу;
			ИначеЕсли ЭлементыФормы.Найти("СтраницаДоставкаПеревозчиком") <> Неопределено Тогда
				СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаПеревозчиком;
			КонецЕсли;
			
		ИначеЕсли СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя")
			  ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи")
			  ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки") Тогда
			
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаНашимиСилами;
			Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи") Тогда
				ЭлементыФормы.СтраницыАдресПередачи.ТекущаяСтраница = ЭлементыФормы.СтраницаАдресПеревозчика;
			Иначе
				ЭлементыФормы.СтраницыАдресПередачи.ТекущаяСтраница = ЭлементыФормы.СтраницаАдресПоставщика;
			КонецЕсли;
			
		ИначеЕсли ЭлементыФормы.Найти("СтраницаСамовывоз") <> Неопределено Тогда
			
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаСамовывоз;
#Вставка
			//***********************************************************************
			//ИЗМЕНЕНО Сухарев Б.В. 14.08.2018
			Если ЭлементыФормы.Найти("ТипДоставки") <> Неопределено Тогда
				ЭлементыФормы.ТипДоставки.Видимость = Ложь;
			КонецЕсли;		// ЭлементыФормы.Найти("ТипДоставки") <> Неопределено 		 
			//***********************************************************************
#КонецВставки
			
		ИначеЕсли ЭлементыФормы.Найти("СтраницаДоставкаНеНашимиСилами") <> Неопределено Тогда
			
			СтраницыДоставки.ТекущаяСтраница = ЭлементыФормы.СтраницаДоставкаНеНашимиСилами;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементыФормы.Найти("СтраницыДоставки") <> Неопределено Тогда
		ЭлементыФормы.СтраницыДоставки.Видимость =
			Не (СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ОпределяетсяВРаспоряжении"));
	КонецЕсли;
	
	Если ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками = Неопределено
	 ИЛИ ЭлементыФормы.Найти("СтраницаДоставка") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДоставкаИспользуется(СпособДоставки, ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками) Тогда
		ЭлементыФормы.СтраницаДоставка.Картинка = БиблиотекаКартинок.Комментарий;
	Иначе
		ЭлементыФормы.СтраницаДоставка.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры
